package ru.popov.javaskill.util;

public class QuizString {
    public static final String BOARDER_LINE = "================================================================================";
    public static final String START_MESSAGE_TYPE = """
            ================================================================================
                            
            Добро пожаловать на квиз!
                            
            Выберите тему

            Core 1 - 1 | Вопросов в модуле: 123

            Core 2 - 2 | Вопросов в модуле: 78

            Счастливых Вам JAVA игр и пусть удача всегда будет с вами!
                            
            ================================================================================
            """;
    public static final String VARIABLE_THEMES_TYPE = """
                                        
            ================================================================================
                        
            Вы выбрали тему под номером: %s
                        
            ================================================================================
                        
            """;
    public static final String VARIABLE_ANSWER_TYPE = """
            
            Для ответа напишите \"ответ\"
            Для выхода нажмите \"выход\" (задано вопросов - %d)
            
            """;

}
